// easy_fifth.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include "pch.h"
#include <iostream>
#include <time.h>

int main()
{
	using namespace std;
	int sum = 0;
	int numbers[30];
	for (size_t i = 0; i < 30; i++)
	{
		numbers[i] = rand() - rand();
		if (numbers[i] < 0)
		{
			sum += numbers[i];
		}
		cout << numbers[i] << " ";
	}
	if (sum != 0)
	{
		cout << "\nSum of all negative elements is: " << sum;
	}
	else
	{
		cout << "Seems like there aren't any negative numbers in this array...";
	}
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
